In [215]:
import pandas as pd
import numpy as np

Our dataset is from: [https://www.kaggle.com/datasets/jackogozaly/data\-science\-and\-stem\-salaries?datasetId=1640011&sortBy=voteCount](https://www.kaggle.com/datasets/jackogozaly/data-science-and-stem-salaries?datasetId=1640011&sortBy=voteCount)

In [216]:
df = pd.read_csv("Levels_Fyi_Salary_Data.csv")

In [217]:
df.head()

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education
0,6/7/2017 11:33:27,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
1,6/10/2017 17:11:29,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN
2,6/11/2017 14:53:57,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN

In [218]:
df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

In [219]:
len(df)

62642

In [220]:
df['company'].isnull().values.any() #tells if missing value in column

True

In [221]:
df['company'].isnull().sum() #tells how many null in column

5

In [222]:
missing_cols = []
for col in df:
    if df[col].isnull().values.any():
        num = df[col].isnull().sum()
        missing_cols.append([col, num]) #shorter way of doing it (not one by one)

In [223]:
print(missing_cols)

[['company', 5], ['level', 119], ['tag', 854], ['gender', 19540], ['otherdetails', 22505], ['dmaid', 2], ['Race', 40215], ['Education', 32272]]

In [224]:
df['otherdetails'].value_counts() #seems kinda useless so get rid of it

Masters                                                                                                                                3983
Title: Software Engineer                                                                                                               1453
Race: Asian, Academic Level: Masterâ€™s degree                                                                                           1213
Race: White, Academic Level: Bachelorâ€™s degree                                                                                         1075
Race: Asian, Academic Level: Bachelorâ€™s degree                                                                                          977
                                                                                                                                       ...
150,000 sign on, Title: Sr. Engineering Manager, Race: White, Academic Level: Doctorate (PhD)                                             1
Title: Sde2, Race: Two or More Races, Academic Level: Doctorate (PhD)                                                                     1
10k relocation, 20k sign in bonus, 35k RSU over 4 years, Title: Tech Lead, Race: Hispanic / Latino, Academic Level: Masterâ€™s degree       1
Title: Pm 3                                                                                                                               1
industry hire                                                                                                                             1
Name: otherdetails, Length: 12841, dtype: int64

In [225]:
df['tag'].value_counts() #see above note

Full Stack                        11382
Distributed Systems (Back-End)    10838
API Development (Back-End)         6277
ML / AI                            4204
Web Development (Front-End)        2971
                                  ...
Public Policy                         1
D&I                                   1
TeleSales                             1
Serverless                            1
Industry Cloud                        1
Name: tag, Length: 3058, dtype: int64

In [226]:
df['level'].value_counts()

L4                             5014
L5                             4871
L3                             3337
L6                             2871
Senior Software Engineer       1443
                               ...
Mid Market                        1
Gr 7                              1
Senior BA                         1
Consulting Analyst                1
Bioinformatics Scientist II       1
Name: level, Length: 2923, dtype: int64

In [227]:
df['dmaid'].value_counts()

807.0    20400
819.0    12343
0.0       9826
501.0     5156
506.0     1773
         ...
503.0        1
687.0        1
693.0        1
651.0        1
658.0        1
Name: dmaid, Length: 149, dtype: int64

In [228]:
df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

In [229]:
df = df.drop(['level', 'tag', 'otherdetails', 'Education', 'Race', 'dmaid'], axis = 1)

In [230]:
df.head()

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
0,6/7/2017 11:33:27,Oracle,Product Manager,127000,"Redwood City, CA",1.5,1.5,107000.0,20000.0,10000.0,...,0,0,0,0,0,0,0,0,0,0
1,6/10/2017 17:11:29,eBay,Software Engineer,100000,"San Francisco, CA",5.0,3.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
2,6/11/2017 14:53:57,Amazon,Product Manager,310000,"Seattle, WA",8.0,0.0,155000.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
3,6/17/2017 0:23:14,Apple,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,157000.0,180000.0,35000.0,...,0,0,0,0,0,0,0,0,0,0
4,6/20/2017 10:58:51,Microsoft,Software Engineer,157000,"Mountain View, CA",5.0,3.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0

In [231]:
df.dropna(inplace=True)
df.reset_index(drop=True, inplace=True)

In [232]:
len(df)

43098

In [233]:
df.columns

Index(['timestamp', 'company', 'title', 'totalyearlycompensation', 'location',
       'yearsofexperience', 'yearsatcompany', 'basesalary', 'stockgrantvalue',
       'bonus', 'gender', 'cityid', 'rowNumber', 'Masters_Degree',
       'Bachelors_Degree', 'Doctorate_Degree', 'Highschool', 'Some_College',
       'Race_Asian', 'Race_White', 'Race_Two_Or_More', 'Race_Black',
       'Race_Hispanic'],
      dtype='object')

In [234]:
df[df["company"] == "Microsoft"]

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
3,4/14/2018 13:05:22,Microsoft,Software Engineer,150000,"Seattle, WA",4.0,0.0,118000.0,5000.0,12000.0,...,0,0,0,0,0,0,0,0,0,0
6,4/16/2018 6:49:59,Microsoft,Software Engineer,230000,"Bellevue, WA",3.0,0.0,140000.0,75000.0,15000.0,...,0,0,0,0,0,0,0,0,0,0
22,4/24/2018 20:56:35,Microsoft,Software Engineer,210000,"Seattle, WA",10.0,10.0,160000.0,30000.0,20000.0,...,0,0,0,0,0,0,0,0,0,0
29,4/28/2018 11:05:34,Microsoft,Product Manager,174000,"Seattle, WA",11.0,3.0,132000.0,22000.0,20000.0,...,0,0,0,0,0,0,0,0,0,0
34,4/30/2018 18:37:16,Microsoft,Product Manager,357000,"Redmond, WA",13.0,13.0,201000.0,100000.0,50000.0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
43078,7/26/2018 19:44:29,Microsoft,Product Manager,1240000,"Seattle, WA",25.0,9.0,310000.0,550000.0,180000.0,...,0,0,0,0,0,0,0,0,0,0
43087,7/29/2018 23:22:30,Microsoft,Software Engineer,135000,"Redmond, WA",1.0,1.0,106000.0,7500.0,10000.0,...,0,0,0,0,0,0,0,0,0,0
43089,8/1/2018 11:52:35,Microsoft,Solution Architect,340000,"San Jose, CA",23.0,13.0,200000.0,60000.0,80000.0,...,0,0,0,0,0,0,0,0,0,0
43091,8/2/2018 12:21:56,Microsoft,Software Engineer,194000,"Tel Aviv, TA, Israel",13.0,6.0,140000.0,29000.0,25000.0,...,0,0,0,0,0,0,0,0,0,0
43095,8/6/2018 10:11:10,Microsoft,Product Manager,305000,"Seattle, WA",20.0,2.0,200000.0,75000.0,30000.0,...,0,0,0,0,0,0,0,0,0,0

In [236]:
min(df["basesalary"])

0.0

In [238]:
max(df['basesalary'])

1620000.0

In [239]:
max(df['bonus'])

1000000.0

In [240]:
df[df['bonus'] == 1000000]

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
326,7/25/2018 12:32:36,IBM,Software Engineer,125000,"Austin, TX",6.0,3.0,125000.0,0.0,1000000.0,...,0,0,0,0,0,0,0,0,0,0

In [241]:
df.value_counts('yearsofexperience') # amount of years of experience

yearsofexperience
5.00     4004
3.00     3947
2.00     3911
4.00     3499
0.00     3198
10.00    3075
1.00     2891
6.00     2757
8.00     2472
7.00     2412
15.00    1866
12.00    1469
9.00     1413
20.00    1210
11.00     816
14.00     786
13.00     777
16.00     503
18.00     437
17.00     356
25.00     273
19.00     213
22.00     163
21.00     133
23.00     110
24.00      92
30.00      90
26.00      38
28.00      29
27.00      28
35.00      25
29.00      19
40.00      12
32.00      10
33.00       9
2.50        8
31.00       6
1.50        6
38.00       4
36.00       3
3.50        3
39.00       2
41.00       2
0.25        2
42.00       2
7.50        2
37.00       2
34.00       1
4.50        1
3.80        1
0.30        1
0.50        1
0.58        1
0.60        1
0.80        1
8.50        1
1.60        1
6.50        1
5.50        1
45.00       1
dtype: int64

In [245]:
df.value_counts('company')

company
Amazon             5525
Microsoft          3641
Google             2978
Facebook           2118
Apple              1384
                   ...
General mills         1
Global payments       1
Globallogic           1
Glu mobile            1
Â Google               1
Length: 1478, dtype: int64

hello world
don't forget .describe!!!
helpful:
.value_counts()
.describe
max()
min()

In [253]:
df[df['basesalary'] >= 1620000]

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
42623,6/12/2018 5:04:06,Squarespace,Software Engineer,162000,"New York, NY",7.0,7.0,1620000.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0

In [254]:
max(df['totalyearlycompensation'])

4980000

In [255]:
df[df['totalyearlycompensation'] >= 4980000]

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
42714,7/30/2021 22:23:24,Facebook,Product Manager,4980000,"Menlo Park, CA",17.0,0.0,380000.0,4400.0,200000.0,...,1,0,0,0,0,1,0,0,0,0

In [256]:
df[df['Race_Asian'] == 1]

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
5129,7/2/2019 16:43:16,Intel,Hardware Engineer,200000,"Santa Clara, CA",14.0,3.0,163000.0,10000.0,27000.0,...,0,0,0,0,0,1,0,0,0,0
7993,10/13/2019 11:43:20,Latch,Software Engineering Manager,170000,"New York, NY",6.0,2.0,170000.0,0.0,0.0,...,0,0,0,0,0,1,0,0,0,0
10054,12/30/2019 11:16:12,Intuit,Software Engineer,134000,"Mountain View, CA",1.0,1.0,110000.0,13000.0,11000.0,...,0,0,0,0,0,1,0,0,0,0
11153,1/27/2020 22:59:06,Google,Software Engineer,400000,"Sunnyvale, CA",5.0,5.0,210000.0,145000.0,45000.0,...,0,0,1,0,0,1,0,0,0,0
11984,2/14/2020 21:22:30,Spotify,Software Engineer,210000,"New York, NY",8.0,2.5,170000.0,40000.0,0.0,...,0,0,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
42611,8/17/2021 8:28:57,Adobe,Product Designer,300000,"San Francisco, CA",5.0,0.0,180000.0,100000.0,20000.0,...,0,1,0,0,0,1,0,0,0,0
42709,2/15/2021 19:50:36,Facebook,Software Engineering Manager,1470000,"Menlo Park, CA",9.0,7.0,290000.0,1100.0,80000.0,...,0,1,0,0,0,1,0,0,0,0
42710,3/9/2021 17:03:07,Google,Product Manager,4500000,"San Francisco, CA",20.0,14.0,450000.0,3700.0,350000.0,...,1,0,0,0,0,1,0,0,0,0
42712,5/14/2021 13:30:43,Amazon,Software Engineering Manager,1660000,"Seattle, WA",15.0,15.0,160000.0,1500.0,0.0,...,0,0,0,0,0,1,0,0,0,0
42714,7/30/2021 22:23:24,Facebook,Product Manager,4980000,"Menlo Park, CA",17.0,0.0,380000.0,4400.0,200000.0,...,1,0,0,0,0,1,0,0,0,0

In [258]:
df[df['Race_Asian'] == 1].value_counts

<bound method DataFrame.value_counts of                  timestamp   company                         title  \
5129     7/2/2019 16:43:16     Intel             Hardware Engineer
7993   10/13/2019 11:43:20     Latch  Software Engineering Manager
10054  12/30/2019 11:16:12    Intuit             Software Engineer
11153   1/27/2020 22:59:06    Google             Software Engineer
11984   2/14/2020 21:22:30   Spotify             Software Engineer
...                    ...       ...                           ...
42611    8/17/2021 8:28:57     Adobe              Product Designer
42709   2/15/2021 19:50:36  Facebook  Software Engineering Manager
42710    3/9/2021 17:03:07    Google               Product Manager
42712   5/14/2021 13:30:43    Amazon  Software Engineering Manager
42714   7/30/2021 22:23:24  Facebook               Product Manager

       totalyearlycompensation           location  yearsofexperience  \
5129                    200000    Santa Clara, CA               14.0
7993                    170000       New York, NY                6.0
10054                   134000  Mountain View, CA                1.0
11153                   400000      Sunnyvale, CA                5.0
11984                   210000       New York, NY                8.0
...                        ...                ...                ...
42611                   300000  San Francisco, CA                5.0
42709                  1470000     Menlo Park, CA                9.0
42710                  4500000  San Francisco, CA               20.0
42712                  1660000        Seattle, WA               15.0
42714                  4980000     Menlo Park, CA               17.0

       yearsatcompany  basesalary  stockgrantvalue     bonus  ...  \
5129              3.0    163000.0          10000.0   27000.0  ...
7993              2.0    170000.0              0.0       0.0  ...
10054             1.0    110000.0          13000.0   11000.0  ...
11153             5.0    210000.0         145000.0   45000.0  ...
11984             2.5    170000.0          40000.0       0.0  ...
...               ...         ...              ...       ...  ...
42611             0.0    180000.0         100000.0   20000.0  ...
42709             7.0    290000.0           1100.0   80000.0  ...
42710            14.0    450000.0           3700.0  350000.0  ...
42712            15.0    160000.0           1500.0       0.0  ...
42714             0.0    380000.0           4400.0  200000.0  ...

      Masters_Degree  Bachelors_Degree  Doctorate_Degree  Highschool  \
5129               0                 0                 0           0
7993               0                 0                 0           0
10054              0                 0                 0           0
11153              0                 0                 1           0
11984              0                 0                 0           0
...              ...               ...               ...         ...
42611              0                 1                 0           0
42709              0                 1                 0           0
42710              1                 0                 0           0
42712              0                 0                 0           0
42714              1                 0                 0           0

       Some_College  Race_Asian  Race_White  Race_Two_Or_More  Race_Black  \
5129              0           1           0                 0           0
7993              0           1           0                 0           0
10054             0           1           0                 0           0
11153             0           1           0                 0           0
11984             0           1           0                 0           0
...             ...         ...         ...               ...         ...
42611             0           1           0                 0           0
42709             0           1           0                 0           0
42710             0           1           0                 0           0
42712             0           1           0                 0           0
42714             0           1           0                 0           0

       Race_Hispanic
5129               0
7993               0
10054              0
11153              0
11984              0
...              ...
42611              0
42709              0
42710              0
42712              0
42714              0

[11703 rows x 23 columns]>